Vue.component("review-component-gallery", {
    template:`
	      <ul class="gallery_wrap row">
              <li v-for="(pet, index) in reviewAnimal" :key="index"
                  class="gallery_list col-6 col-xl-3"
                  v-bind:style="{'background-image': 'url(' + pet.reviewThumbnail + ')'}">
                  <div class="gallery-txt">
                  	  <p class="gallery-type">분당야탑점</p>
                      <h3 class="gallery-tit">{{pet.reviewTit}}</h3>
                      <p class="gallery-cont">{{pet.reviewTxt}}</p>
                      <a class="btn" href="">
                      	more
                      	<img src="https://www.shinsegae.com/resources/site/img/main/ico_hotnew_more.png">
                      </a>
                  </div>
              </li>
         </ul>
    `,
    props:["reviewAnimal"]
});

Vue.component("review-component", {
    template:`
		  <div id="AdoptReview-wrap">
		      <div id="AdoptReview" class="container"> 
			        <div class="tit_area">
			            <h1 class="main_tit">Adopt Revie</h1>
			            <p class="main_txt">가족이 된 아이들을 자랑해주세요</p>
			        </div>
			        <div class="reviewTabs">
			            <div class="tab-btn">
			                    <button v-for="(tab, index) in tabs" 
			                        :key="index"
			                        :class="{active: currentTab == index}"
			                        @click="currentTab = index">{{tab}}</button>
			            </div>
			            <div class="tab-content">
			                <div v-show="currentTab==0">
			                	<review-component-gallery :reviewAnimal="reviewDog" ></review-component-gallery>
		                	</div>
			                <div v-show="currentTab==1">
			                	<review-component-gallery :reviewAnimal="reviewCat" ></review-component-gallery>
		                	</div>
			            </div>
			        </div>
			        <div class="btn-wrap">
			            <a href="" class="view_btn">view more</a>
			        </div>
			  </div>
		  </div>
    `,
    data(){
  	  return{
  		currentTab:0,
		tabs:["Dog", "Cat"],
	    reviewDog:[
	        {   
	            reviewThumbnail : "http://d12l2mexpetzlh.cloudfront.net/images/story/2021-08-28/story_1630140007992.jpg",
	            reviewTit : "아니🤗 어떻게 이렇게 귀여운 강아지가 있지?!?!?!",
	            reviewTxt : "안녕하세요 저는 무꾸를 입양한 지 3-4개월차 되어 가는 초보 보호자입니다 사실 저는 이번에 무꾸를 입양하면서 강아지를 처음 키우게 되었어요 전부터 유기견을 입양하고 싶다는 마음은 있었습니다 하지만 제가 초보인 데다가 유기견이라는 편견이 아직 있던 시기였기에 가족들의 반대가 심해서 포인핸드만 매일 들락날락거렸습니다… 그러다 무꾸가 안락사 위기에 처했다는 게시물을 보고 가족들을 설득하고 또 설득하여 데리고 오게 되었습니다 한 번 입양을 하려던 분이 계셨는데 갑자기 취소를 하셔서 안락사 위기에 처했던 것 같았어요 아마 무꾸가 이미 성견이었고 슬개골 탈구, 짖음, 입질이 심하다는 보호소의 말 때문인 것 같았습니다 하지만 집에 와 보니 얌전한 애교쟁이가 된 것 아니겠어요?!?! 유기견들의 성향은 집에 오기 전까지는 절대 알 수 없는 것 같아요… 처음에는 중성화 시기를 놓쳐 심한 마운팅에 뼈가 다 만져질 정도로 삐쩍 말랐었고 산책 방법을 몰라 줄당김이 너무 심해 발톱이 다 갈려서 피가 나서 제 속을 많이 썩였지만 중성화 수술을 해 주고 밥도 열심히 챙겨 주고 산책 교육을 꾸준히 해 주었더니 지금은 몰라 보게 달라졌답니다 ㅎㅎ 날이 갈수록 귀여워지는 무꾸 구경하러 오세요!",
	        },
	        {   
	            reviewThumbnail : "http://d12l2mexpetzlh.cloudfront.net/images/story/2021-08-28/story_1630115165330.jpg",
	            reviewTit : "🐶🤍사지말고 입양하세요~~~",
	            reviewTxt : "탕이를 데려온지 4년이 됐지만 지금도 사람들이 탕이를 보면 몇개월이냐고 애기인줄 알았다고 할 정도로 너무 작고 귀엽고 소중해요 … ☺️ 애교도 너무 많아서 새로운 사람들 만날 때 마다 주인이 바뀌는 탕이 그래도 좋으니 건강하게 오래 살쟈 울 아가 💗💗💗",
	        },
	        {   
	            reviewThumbnail : "http://d12l2mexpetzlh.cloudfront.net/images/story/2021-08-27/story_1629995257919.png",
	            reviewTit : "널🧡 만나기전에 엄만 정말 몰랐단다",
	            reviewTxt : "엄마는 지금생각해보면 우리 라온이를 못만났다면 평생을 이런행복이 있다는걸모른체 살아갔겠지..엄마는 정말몰랐어..너희들이 주는사랑이 얼만큼인지..너희들의 존재만으로도 행복감을 준다는걸 엄마는정말 몰랐단다..예전에는 말이야 라온아..사람들이 강아지들보고 엄마야~아빠야~하는것도  이해할수없었고...강아지랑 뽀뽀하는것도 더럽게 뭐하는거야 하며 살았단다...이런엄마가 어느순간 유기견들이 눈에들어왔고 너희들에대해 1도몰랐던엄마가 공부를하고...나도 너희들을품을수있을꺼라 확신이생기기전까지 많은준비를했단다..지금당장이쁘다고 너희들을데려와서는 절대안된다는걸 마음깊이새기고 끝까지 함께한다는생각으로..마음을다잡고 또다잡고 아빠랑 형아들과 충분히 상의후 너를만났어. 너로인해 엄마삶이 많이변하겠지..식구들끼리 아무데나가서 외식도못할꺼고..하지않던 지출이생길것이며 어쩌면 큰 목돈도 나가게되겠지..엄마만의 시간도 많이없어질것이고 너희들의 언어를 모르기에 너의표정하나 몸짓하나하나보며 라온이가 무엇을원하는지 알려고 열심히 노력하겠지^^근데 라온아~~그거아니?너로인해 많은 제약이 엄마삶에 생겨도 엄마는 전혀불편하지않고 날만나후로 엄마가 너무너무행복하다는거^^엄마에게와줘서 고마워엄마아빠 아들이 되어줘서고마워형아들의 동생이되어줘서 고마워이런행복이 있다는것 조차 모르고살았던 엄마에게 너무큰행복을가르쳐줘서 너무고마워 엄마가 우리라온이에게 이거하나만은 꼭 약속할께우리라온이가 100년살다가 강아지별로가는 그순간까지 엄마는 우리 라온이곁에서 손꼭잡고 놓치 않을께꼭 약속할께 울애기 우리 라온이 엄마가 항상지켜줄께 나보다 더 널사랑한단다.지금처럼만 건강하게 다른거 안바라니 건강하게만 있어주렴^^",
	        },
	        {   
	            reviewThumbnail : "http://d12l2mexpetzlh.cloudfront.net/images/story/2021-08-18/story_1629287242775.jpg",
	            reviewTit : "어느덧 20일💖",
	            reviewTxt : "뽀기가 입양온지 어느덧 20일이 됐어요!20일동안 많은 일들이 있었는데 그래도 건강하게 자라줘서 너무 고마워요 뽀기야 근데 그만 물어줘,, 너무 아파",
	        },
	        {   
	            reviewThumbnail : "http://d12l2mexpetzlh.cloudfront.net/images/story/2021-08-17/story_1629175805772.jpg",
	            reviewTit : "쪼꼬미때온 무야호~🎶",
	            reviewTxt : "6/11 처음 임보로 만난 무야호 그땐 눈도 제대로못뜨고 걷지도못하고한손으로도들수있는 분유먹던 아가였는데  벌써 이리? 컷네요 ㅋㅋㅋㅋ 잠잘때 못생기고 사람처럼자는게 매력적인 무야호 임보종료! 제가 입양 하였습니다! 사랑으로 잘키우겠습니다 자주같이놀러다니자 무야호 사랑해🐶❤️",
	        },
	        {   
	            reviewThumbnail : "http://d12l2mexpetzlh.cloudfront.net/images/story/2021-08-16/story_1629083072990.png",
	            reviewTit : "쿠키랑 139일째!",
	            reviewTxt : "어느새 쿠키랑 넉달이 넘는 시간 동안 함께하고 있네요ㅎㅎ 모든 예방접종 마치고 곧 중성화하는데 생각나서 찾아왔답니다ㅎㅎ 언제나 소중한 인연 맺게 해줘서 감사하고 있습니다! 지금 우리 쿠키는 제 침대에서 낮잠자고 있다네요ㅋㅋ(저는 바닥에 누워있는 중ㅠ)",
	        },
	        {   
	            reviewThumbnail : "http://d12l2mexpetzlh.cloudfront.net/images/story/2021-08-15/story_1629002233220.jpg",
	            reviewTit : "우디 입양했어요💚💛🧡",
	            reviewTxt : "우디 입양했어요! 약 한 달 정도 포인핸드와 인스타를 계속 드나들고 있던 와중에 감사하게도 보호소에서 아이 데려가라고 연락이 왔어요 한 시간 정도 차 타고 왔는데도 차분하게 잘 있어줬어요ㅎㅎ 다행히 전염병 검사 모두 음성이고 진드기도 없고 깨끗하대요!!🥺 한 달 정도 뒤에 중성화 수술할 거고 담주에는 1차 접종 맞아요 수의사 선생님은 너무 순하다고 말씀하시네요 ㅎㅎㅎ 울타리 생활이 답답하더라도 잘 지내보자!! 앞으로 건강하게 오래 살자 우디야🥰",
	        },
	        {   
	            reviewThumbnail : "http://d12l2mexpetzlh.cloudfront.net/images/story/2021-08-08/story_1628350593484.jpg",
	            reviewTit : "💙여름 바다처럼 청량한 여름이🐶🤍",
	            reviewTxt : "안녕하세요 !여름이가 벌써 저희 집에 온 지 한달이 다 되어가는데 이제야 입양 후기를 올리네요ㅠㅠ반년 넘게 포인핸드를 살피다, 여름이를 보고 첫눈에 반해서 데려오게 되었어요 :)공고기간을 이틀 앞두고 여름이가 고양이 간식 외엔 밥을 아예 먹질 않고, 혈변에 토까지 했다고 해서 걱정을 많이 했어요...하지만 감사하게도 보호해주시던 병원 측에서 잘 돌봐 주셔서 건강히 저희 가족 품으로 올 수 있었어요! 실제로 만나서 본 여름이는 공고사진보다 더 사랑스러웠어요🥰 제게 걸어오는 여름이를 보니 괜히 눈물이 날 것 같더라고요 이런게 운명인가 싶고...여름이는 집에 온 첫날부터 낯도 가리지 않고 혼자서 앉아 엎드려까지 다 하는 천재견이었어요! 밥을 거의 안 먹어서 문제였지만, 걱정하는 제 마음을 알아챘는지 이튿날부턴 사료도 조금씩 먹기 시작했고 이젠 잘 먹고 잘 싸는 튼튼이가 되었답니다 ◡̈1.8kg이었던 여름인 어느새 2.7kg이 되었어요 금세 커가는 여름이를 보다보면 정말 하루하루가 아까워요ㅠㅠ 그래서 사진도 많이 남기고 아낌없이 사랑을 주며 지내고 있답니다😊여름이가 오고나선 가족들이 여름이 본다고 거실을 떠나질 않아요ㅎㅎ 여름이 하나 덕에 일상이 밝아졌어요💖 여름이는 뽀뽀를 엄청 좋아해서 틈만 나면 가족들을 찾아와서 뽀뽀를 하고 가는 사랑스러운 아이랍니다 !사람도 너무 좋아하고 아직 세상에 궁금한게 많은 아가여서, 매일 산책도 나가며 최대한 많은 것을 경험하게 해주려고 노력하고 있어요ㅎㅎ비록 완벽하진 못해도 모자람 없는 보호자가 되어주고 싶어 저도 열심히 공부하고 최선을 다하고 있습니다. 우리 여름이 앞으로도 건강하고 행복하게! 오래오래 함께 지내줬으면 좋겠어요☺️ 여름아 누나가 많이 사랑해🐶🤍",
	        }
	    ],
	    reviewCat:[
	    	{   
	            reviewThumbnail : "http://d12l2mexpetzlh.cloudfront.net/images/story/2021-08-17/story_1629202210279.png",
	            reviewTit : "이렇게 컸어요!🤍",
	            reviewTxt : "언젠가 고양이를 입양하고 싶어서 한동안 포인핸드를 계속 보고 있었는데 어느날 빵떡이가 쨘! 그 전에는 입양 신청서 넣지도 못했는데 빵떡이는 꼭 신청이라도 해야겠다!  해서 처음으로 입양신청서를 넣었어요사실 첫 냥님이라 제가 될지 몰랐어요 공고 마지막날 한국동물구조관리협회에서 연락이 왔는데 소리지를뻔했어요! 다음날인 21일 토요일에 데리러 갔는데 이곳에서도 빵떡이는 인기 스타였나봐요 직원분들이 엄청 이뻐해주심 ㅎㅎ 실제로 보니 더 귀여웠어요ㅠㅠ 거기서도 소리지를뻔애써 냉정을 잃지 않고 계약서를 쓰고 입양수속을 밟았어요데리고 온 날부터 온집안을 돌아다니고... 냥님이 아니라 개님 데리고 온줄ㅎㅎㅎ 무릎위에서도 잠드네요ㅠㅠ 감동 ㅠㅠ사진 너무 못찍어서 아쉬워요ㅠ 정말 저 미모가 다 안담겨요ㅠㅠ 병원에 데리고 갔는데 병원에서도 세상 순둥이...건강하구요 정말 착한 친구예요 제가 어쩌다 이런 천사를 만났는지ㅠㅠ 우리 오래오래 같이 가자~ ",
	        },
	        {   
	            reviewThumbnail : "http://d12l2mexpetzlh.cloudfront.net/images/story/2021-07-07/story_1625609850976.png",
	            reviewTit : "아기냥이 데려왔어요🐱",
	            reviewTxt : "저희 집에 귀여운 아기동물친구가 찾아왔어요:)저희 솜이를 보호소에서 데려오고 행복하게 지내는모습을 오랫동안 지켜보던 동생네 부부가얼마전부터 고양이를 데려오고싶다고 이야기 하더라구요오랜고민과 공부를 하던 동생이 결심을 하고알아보는 과정에 제가 조심스럽게 보호소아이에 대해이야기 해주었어요동생네 부부가 이야기를 듣더니 너무 안쓰러워하며고민끝에 좋은 결정을 해주어 부랴부랴 보호소에 전화하고 오늘 다녀왔어요^^의정부에서 제가 있는 전주로 찾아와 함께 정읍보호소에다녀왔는데 공고사진에서도 정말 예쁜아이가실제로 보니 너무 작고 귀여워 바로 절차밟고 데려왔네요강쥐 냥이 할 것 없이 너무 예쁜 아이들이 많이 있어서다 데려올 수 없다는게 정말 아쉽고 안타까웠어요😥공고사진보다 실제로 보면 정말 예쁜 아이들이 많답니다고민하시는 분들이 계시다면 꼭 한번 찾아가보시길 바래요🙏예쁜 가족 보내주셔서 감사드립니다앞으로 건강하고 예쁘게 잘 키우도록 할께요❤*보호소에 형제냥이들이 정말 예뻐요😥사진보다 실물이 더 예쁘니 고민중이시라면꼭 한번 찾아가보세요 후회 안하실거에요🙏",
	        },
	        {   
	            reviewThumbnail : "http://d12l2mexpetzlh.cloudfront.net/images/story/2021-08-01/story_1627816180920.jpg",
	            reviewTit : "안농♡ ♡ ♡  난 김모찌 1개월이지",
	            reviewTxt : "안녕하세요!오늘은 저희집에 너무너무 이쁜 막내가 선물처럼 저희에게 와줬어요🤍이름은 모찌! 1개월된 아깽이에요♡ 모찌는요~ 어미묘가 길에서 구조가 되었는데,알고보니 임신중인 아이였어서 어미묘 키우시는 분이 직접 손으로 아이들을 다 받으셨대요!저희 모찌 많이 이뻐해주세요!",
	        }
	        ,
	        {   
	            reviewThumbnail : "http://d12l2mexpetzlh.cloudfront.net/images/story/2021-08-02/story_1627830612844.jpg",
	            reviewTit : "😰곰팡이 따위 언니가 박멸해줄께!!",
	            reviewTxt : "뽀송이가 처음 올 때 부터 뒷 발바닥? 발가락 쪽에 거무튀튀한게 있어서 뭐가 묻어서 온 줄 알았었는데 지내면거 보니까 털이 더 빠지고, 가려운지 물고 핥더라구요ㅠㅠ 발바닥은 살이 습진처럼 벗겨지구요..7월 30일에 병원 데려가보니 역시나 곰팡이균😰 주사 맞고 소독하고 그 소독 부위에 감아놨어요 핥을 수 있으니까😂😂 약 먹고, 이제 붕대 제거하고 약용샴푸로 씻고 해서 얼른 나았으면 좋겠네요💜🙏🏻",
	        },
	        {   
	            reviewThumbnail : "http://d12l2mexpetzlh.cloudfront.net/images/story/2021-07-25/story_1627223238347.png",
	            reviewTit : "사람들이 묘연이래요♡",
	            reviewTxt : "쪼식이와 아톰이를 입양하면서 거제도 유기동물 봉사 카페의 소식들을 가끔 보고 있던 중 한쪽 눈을 수술한 미야가 퇴원 후 갈 곳을 찾는 글을 보았어요. 너무너무 이쁘니까 데리러 가려는 사람들이 많겠지 했지만 그렇지 않았던 것 같아요. 임시보호 중인 곳에서 지내며 숨어 있느라 사진 찍기도 쉽지 않다는 이야기를 보고 저희 집에 데려와 맛있는 거 많이 먹여주고 지내고 싶어 입양 신청을 했어요.이번에도 물론 버스를 타고 거제도에 갔고 안전하게 잘 모시고 왔답니다.너무도 다행스럽게 집에 온 날부터 장난감을 가지고 놀고 자기 집도 잘 찾아 들어가 잘먹고 잘자고 하는 행동도 진짜 예뻐요.봉사자님들께서는 미야의 눈을 살리려고 노력하셨고 또 그러지 못한 것에 대해 마음 아파 하시지만 지금 저의 아이는 특별한 것 없이 잘 지내고 있어요. 저희는 미야가 불쌍하다고 생각하지 않거든요. 그저 너무 예뻤고 지금도 예뻐요. 미야라는 이름이 저는 좋아서 지금도 그렇게 부르지만 가족들의 뜻에 따라 은동이라고 부르고 있답니다♡은동이 소식을 들려드릴 때마다 묘연이라고 말씀해주셔서 저는 기분이 넘 좋아요.은동이에게 아픔이 있었지만 그래서 저희가 가족이 될 수 있었다는 생각을 늘 하고 있어요.은동이를 구조해서 건강하게 돌봐주시고 맡겨주신 봉사자님들께 늘 감사드려요~",
	        },
	        {   
	            reviewThumbnail : "http://d12l2mexpetzlh.cloudfront.net/images/story/2021-07-23/story_1627000633062.jpg",
	            reviewTit : "미르가 집에온지 271일❤️",
	            reviewTxt : "미르는 요즘 날씨가 너무 더워서 축 늘어져 있다가에어컨 틀어주면 신나서 이리저리 뛰어다니는 생활을 하고 있어요💕 어제는 심장사상충약 바르는 것 때문에 병원을 갔는데 계속 으르렁 거리고 하악질해서 간호사선생님들도 무서워하더라구요ㅠㅜㅜ 그래도 집와선 다시 쌩쌩해졌어요😉",
	        },
	        {   
	            reviewThumbnail : "http://d12l2mexpetzlh.cloudfront.net/images/story/2021-07-18/story_1626586342756.png",
	            reviewTit : "♡우리 사랑이♡ 이야기",
	            reviewTxt : "5월1일 울집에 첫번째 아기 순이가 왔었지만 6월6일에 무지개다리를 건넜어요.ㅠㅠ 그리고 만나 두번째 아기가 5월1일생 사랑이랍니다. 지금은 사랑이와 함께 행복하게 지내고 있어요.여기에는   사랑이사진만   있습니다 ",
	        },
	        {   
	            reviewThumbnail : "http://d12l2mexpetzlh.cloudfront.net/images/story/2021-07-15/story_1626336606495.jpg",
	            reviewTit : "우리 귀여운 로지😽🌹 보구 가세용",
	            reviewTxt : "포인핸드를 통해 만난 저의 소중한 가족이 된 로지를 소개할게요:) 나이가 들어가면서 이제는 나만이 아닌 다른 누군가를 책임져보고 싶다는 생각이 들어 반려동물을 생각하고 있던 중에 포인핸드어플을 통해 로지를 만나게 되었어요. 하얗고 눈이 호박색으로 빛나는 이 아이를 보니, 그 동안 기다리던 아이가 이 아이였구나 싶었어요! 구호자님에 의하면 처음에 로지는 4다리가 어디에 쓸린거 마냥 상처 투성인 채로 아파트 단지 내에서 발견이 되었다고 해요. 혹시 몰라 며칠을 지켜보고 주인이 실수로 잃어버린게 아닌가 싶어 기다렸다고 하지만 결국 나타나지 않았다고 해요. 처음 케이지를 통해 이동할 때도 의사샘의 진찰을 받을 때도 원래 길 고양이가 아닌 주인이 있던 고양이 같다고 했었어요 ㅠㅠ그래도 다행히도 좋은 구호자님께서 우리 로지를 구해주시고 좋은 임보자님을 통해 저를 만나기 전, 3개월 정도 잘 돌봐주셨고, 그렇게 저와 인연이 돼서 저의 가족이 되었답니다😸저를 처음 만날 때도, 집에 처음 왔을 때도 낯 가리지않고 너무 이쁘게 행동하는 아이에요:) 점점 더 이뻐지는 우리 로지를 보면서 이렇게 이쁜 아이를 버린 사람이 누구인지 화가 나다가도 로지 덕분에 제 삶이 더 행복해지는 걸 생각하면 인연이라는게 이런거구나 싶기도 해요! 말썽꾸러기에 힘도 쎄고 애교도 많고 어딜가나 저만 졸졸 따라다니는 로지🌹 아! 로지 이름의 뜻은 Rosy(뜻 : 장미빛의) 영어에서 따온 거에요! 앞으로 로지의 삶이 장미 빛으로 가득하라는 의미랍니다🌹유기묘라해서 편견 갖지 않다면 다를게 없는 아이에요. 혹여나 유기묘입양에 걱정이 많으신 분들이 계시다면 우리가 아이를 사랑하는 마음이면 충분하다구, 우리의 사랑으로 한 생명이 새로운 삶을 살 수 있다구, 그리고 그 아이가 내게 주는 사랑이 내가 주는 사랑보다 더 크다고 말해주고 싶어요:)💜💜그럼 이만 뿅🌹",
	        },
	     ]
  	  }
    }
});



